ALTER TABLE `nrcf` ADD `cfenc` VARCHAR( 255 ) NOT NULL AFTER `cfenf`;
ALTER TABLE `nrtb` DROP `tbcs`;

UPDATE `nrad` SET `adpw`=PASSWORD(`adpw`);

DELETE FROM `nrnv` WHERE `nvid`>=1 AND `nvid`<=11;
INSERT INTO `nrnv` VALUES ('1', '', '', 's', 'nrtb', '');
INSERT INTO `nrnv` VALUES ('2', '', 'Администрированиe', 'l', '', '');
INSERT INTO `nrnv` VALUES ('3', '', 'Администраторы', 't', 'nrad', '');
INSERT INTO `nrnv` VALUES ('4', '', 'Роли', 't', 'nrrl', '');
INSERT INTO `nrnv` VALUES ('5', '', 'Роли администраторов', 't', 'nrur', '');
INSERT INTO `nrnv` VALUES ('6', '', 'Права доступа к табл', 't', 'nrat', '');
INSERT INTO `nrnv` VALUES ('7', '', 'Цветовые схемы', 't', 'nrcr', '');
INSERT INTO `nrnv` VALUES ('8', '', 'Меню', 't', 'nrnv', '');
INSERT INTO `nrnv` VALUES ('9', '', 'Журнал операций', 't', 'nrlg', '&sort=lgdt&dir=DESC');
INSERT INTO `nrnv` VALUES ('10', '', 'Архивация', 'o', '', 'tools/backup.php');
INSERT INTO `nrnv` VALUES ('11', '', '', 's', '', '');


DELETE FROM `nrcf` WHERE `cftb`='nrcf' OR `cftb`='nrtb' OR `cftb`='nrlg';
INSERT INTO `nrcf` VALUES ('1', 'cfid', 'nrcf', 'y', '# поля', 'Определяет порядок следования поля при поиске и в форме добавления.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'y', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('2', 'cffl', 'nrcf', 'y', 'Код поля', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'y', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('3', 'cftb', 'nrcf', 'y', 'Код таблицы', '', 'y', 'y', 'y', 'n', 'nrtb', 'tbnm', '', 'n', '', 'tbds', 'n', 'y', 'n', 'y', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('4', 'cfsw', 'nrcf', 'y', 'Видимое ли для редактирования?', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('5', 'cfnm', 'nrcf', 'y', 'Наименование', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('6', 'cfds', 'nrcf', 'y', 'Всплывающая подсказка', 'Описание поля, всплывает при наведении на заглавие поля.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('7', 'cfsv', 'nrcf', 'y', 'Видимое ли в поиске?', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('8', 'cfsr', 'nrcf', 'y', 'Возможен ли поиск по полю?', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('9', 'cfel', 'nrcf', 'y', 'Связать таблицу по этому полю?', 'Если установлен данный флажок, то таблица указанная в &quot;Связанная таблица&quot; будет защищена от удаления данных если на них есть ссылка в данной таблице.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('10', 'cfme', 'nrcf', 'y', 'Мультиудаление?', 'Если да то при удалении все таблицы которые используют данные этой таблицы (связанны с ней), будут очищены по даным связки. Данные в корзину из привязанных таблиц не попадают.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('11', 'cfen', 'nrcf', 'y', 'Мастер таблица', 'Из указанной таблици будут подставлятся данные в данныю.', 'y', 'y', 'y', 'n', 'nrtb', 'tbnm', '', 'n', '', 'tbds', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('12', 'cfenf', 'nrcf', 'y', 'Поле для возврата', 'Какое поле из &quot;Мастер таблицы&quot; будет возвращаться.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('13', 'cfenc', 'nrcf', 'y', 'Контекст возврата', 'Указать строку с пометкой места для вставляемых данных. (место указать - {*})', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('14', 'cfpd', 'nrcf', 'y', 'Включить для мастер таблици<br>функцию передачи параметров?', 'Для мастер таблици будет вулючена функция передачи параметров в данную таблицу и появится соответствующая кнопка.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('15', 'cfdt', 'nrcf', 'y', 'Предопределенное значение', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('16', 'cfvf', 'nrcf', 'y', 'Какое поле показовать', 'Какое поле из &quot;Мастер таблицы&quot; будет возвращаться для вспомогательного отображения.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('17', 'cfct', 'nrcf', 'y', 'Не показывать значение?', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('18', 'cfaa', 'nrcf', 'y', 'Поле для функции &quot;Добавить еще&quot;?', 'Значение поля будет передаваться для функции &quot;Добавить еще&quot;.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('19', 'cfor', 'nrcf', 'y', 'Поле для сортировки?', 'Поле является полем для сортировки.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('20', 'cffe', 'nrcf', 'y', 'Поле обязательно для заполнения?', 'Не работает для типa - BLOB.', 'y', 'y', 'n', 'n', '', '', '', 'n', 'n', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('21', 'cffo', 'nrcf', 'y', 'Редактирование запрещено?', '', 'y', 'y', 'y', 'n', '', '', '', 'n', 'n', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('22', 'cfmd', 'nrcf', 'y', 'Дополнительный модуль', 'Ссылка на файл модуля который будет использовать значение данного поля как параметр.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('23', 'cfmv', 'nrcf', 'y', 'Модуль проверки и обработки<br>введенных данных.', 'Получает данные в виде строки, и выдает массив где el[0] - boolean (ошибка или нет), el[1] - сообщение, el[2] - строка после обработки/коррекции.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('24', 'cffn', 'nrcf', 'y', 'Функция для поля', 'Функция SQL которая будет применятся к данным поля при добавлении и редактировании записи.', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');

INSERT INTO `nrcf` VALUES ('1', 'tbnm', 'nrtb', 'y', 'Код таблицы', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('2', 'tbds', 'nrtb', 'y', 'Описание', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('3', 'tbtx', 'nrtb', 'y', 'Текст помощи', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('4', 'tbnu', 'nrtb', 'y', 'По сколько записей показывать в поиске', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '20', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('5', 'tbdl', 'nrtb', 'y', 'Через сколько дней удалять из корзины', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('6', 'tbro', 'nrtb', 'y', 'Только чтение?', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('7', 'tbss', 'nrtb', 'y', 'Скрипт', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');

INSERT INTO `nrcf` VALUES ('1', 'lgpk', 'nrlg', 'n', 'ID', '', 'n', 'n', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('2', 'lgid', 'nrlg', 'y', 'Логин', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('3', 'lgtb', 'nrlg', 'y', 'Таблица', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('4', 'lgop', 'nrlg', 'y', 'Операция', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('5', 'lgst', 'nrlg', 'y', 'Статус', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('6', 'lgip', 'nrlg', 'y', 'IP', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');
INSERT INTO `nrcf` VALUES ('7', 'lgdt', 'nrlg', 'y', 'Дата/время', '', 'y', 'y', 'y', 'n', '', '', '', 'n', '', '', 'n', 'n', 'n', 'n', 'n', '', '', '');

UPDATE `nrcf` SET `cffn`='PASSWORD' WHERE `cffl`=`adpw` AND `cftb`=`nrad`;
